//
//  ForZodic.swift
//  15.davaleba
//
//  Created by Data on 11.04.24.
//

import Foundation

struct Zodiacs {
    let name: String
    let imageName: String
    let text: String
    let polar: String
    let polarIcon: String
}

let ariesVariable = Zodiacs(name: "ვერძი", imageName: "aries", text: "დაბადებულია მოგებისთვის, ძალიან აქტიური და კომუნიკაბელურია. არის თავმოყვარე, თავდაჯერებული, უშიშარი. მას მართავს გრძნობები, ჯერ აკეთებს და მერე ფიქრობს. იმპულსურია. გრძნობები უბინდავენ გონებას. ვნებიანი და ეგოისტია. ვერ იტანს, როცა რამეს უკრძალავენ. მათში ყველაფერი დიდი დოზითაა. ასევე ავანტიურისტია.", polar: "სასწორი", polarIcon: "libra")

let taurusVariable = Zodiacs(name: "კურო", imageName: "taurus", text: "პრაქტიკული, რეალისტი, პრაგმატული, პესიმისტი, უყვართ და პატივს სცემენ სიმდიდრეს, მაგრამ ხემოჭერილები არიან, უფრთხილდებიან იმას, რაც აქვთ. იზიდავთ გართობა და სიამოვნება. უყვართ სახლი და ოჯახი. მესაკუთრეები და კარგი მშობლები არიან. ჯიუტები, ძლიერი სულის პატრონები და შრომისმოყვარეები არიან. არ აქვთ არასრულყოფილების კომპლექსი. სულის სიღრმეში თავი სამყაროს ღერძებად მიაჩნიათ.", polar: "მორიელი", polarIcon: "scorpio")

let geminiVariable = Zodiacs(name: "ტყუპები", imageName: "gemini", text: "ძალიან უყვართ ჭორების და ინფორმაციების შეგროვება. იციან ყველაფერი ყველაფერზე და მათ შეიძლება შეხვდეთ ყველგან. გონებამახვილი, ცოცხალი, კომუნიკაბელური, მჭერმეტყველი.. ეს ყველაფერი ტყუპებზეა ნათქვამი. მათთან არ მოიწყენ. მიისწრაფიან სრულყოფილებისკენ, რათა ყველას თავი მოაწონონ. ადვილად ეგუებიან ყველაფერს. აქვთ უამრავი იდეა... სჭირთ გაორება.", polar: "მშვილდოსანი", polarIcon: "sagittarius")

let cancerVariable = Zodiacs(name: "კირჩხიბი", imageName: "cancer", text: "რომანტიკული, გულიანი, უყვართ ბავშვები, ცხოველებიც. აქვთ მაღალი პასუხისმგებლობის გრძნობა. არიან დაკომპლექსებულები, ძალიან ეჭვიანები, თავგანწირულები, სენტიმენტალურები და კონსერვატორები. მესაკუთრეები, მგრძნობიარეები. აქვთ მდიდარი ფანტაზია და კარგი ინტუიცია..", polar: "თხის რქა", polarIcon: "capricorn")

let leoVariable = Zodiacs(name: "ლომი", imageName: "leo", text: "მამაცი, შეუპოვარი და გულუხვი. ცნობისმოყვარე, გავლენიანი, ცეცხლოვანი, უყვარს მართვა, საკუთარ თავზე შეყვარებული, ეგოცენტრიკი, პრესტიჟი მათთვის ყველაფერია, მიმზიდველი, არტისტული, მაგნიტური, დაბადებულია ლიდერად, რომანტიკული, ქარიზმატული, უყვართ ყურადღების ცენტრში ყოფნა და ხშირად იმსახურებენ კიდეც", polar: "მერწყული", polarIcon: "aquarius")

let virgoVariable = Zodiacs(name: "ქალწული", imageName: "virgo", text: "თავშეკავებული, პედანტური, ანალიტიკური გონება, კრიტიკოსი, ყურადღებას აქცევს წვრილმანებს, რაციონალური, გამოთვლილი და დაგეგმილი აქვს ყველაფერი. პრაქტიკოსი, მომთხოვნი, საღი გონების პატრონი.", polar: "თევზები", polarIcon: "pisces")

let libraVariable = Zodiacs(name: "სასწორი", imageName: "libra", text: "გაუბედავი, ჰარმონიული, პაცეფისტი, დამთმობი, გაურბის კონფლიქტეპს, დიპლომატი, არ უყვარს მარტოობა, ხშირად სისულელეებს აკეთებს, იდეალისტი, რომანტიკოსი, მიმზიდველი, უყვარს ხელოვნება, ახასიათებს მოუთმენლობა.", polar: "ვერძი", polarIcon: "aries")

let scorpioVariable = Zodiacs(name: "მორიელი", imageName: "scorpio", text: "მიდრეკილია დაპყრობისკენ, მისი დევიზია 'ყველაფერი ან არაფერი', ვნებიანია, მოსწონს მისტიკა, არღვევს ტაბუებს, თავდაჯერებული და მესაკუთრეა. ჯიუტი, რისკიანი, ემოციური, მიმწოლი ხასიათისაა.", polar: "კურო", polarIcon: "taurus")

let sagittariusVariable = Zodiacs(name: "მშვილდოსანი", imageName: "sagittarius", text: "პირდაპირი, სამართლიანი, აგრესიული ოპტიმისტი, უყვარს ძებნა და პოვნა, არ აქვს ზომიერების შეგრძნება, სულ მოძრაობს, ფარული სურვილი აქვს ფლობის, იმპულსურია.", polar: "ტყუპები", polarIcon: "gemini")

let capricornVariable = Zodiacs(name: "თხის რქა", imageName: "capricorn", text: "ახასიათებს თავმოყვარეობა, სიმდიდრის სიყვარული, პრაგმატულობა, სიფრთხილე, ამბიციურობა, თავშეკავებულობა, დამოუკიდებლობა . მათთვის ძალიან მნიშვნელოვანია მატერიალური კეთილდღეობა და სტატუსი. არიან კარიერისტები და კონსერვატორები. მერწყული: ორიგინალური, ალტრუისტი, იდეალისტი, იდეალური მებრძოლი, კომუნიკაბელური, თავისუფლების მოყვარული, ექსტრავაგანტული, უყვარს პუბლიკის შოკურ მდგომარეობამდე მიყვანა. არიან ინტელექტუალები, ვერ იტანენ რუტინულ ცხოვრებას.", polar: "კირჩხიბი", polarIcon: "cancer")

let piscesVariable = Zodiacs(name: "თევზები", imageName: "pisces", text: "მგრძნობიარე მეოცნებეები, მდიდარი ფანტაზია, მიმზიდველობა, შემოქმედებითი ხასიათი, არტისტიზმი, პასიურები, გაუბედავები, ფატალურები, რეფლექსურები, აქვთ კარგი ინტუიცია.", polar: "ქალწული", polarIcon: "virgo")

let aquariusVariable = Zodiacs(name: "მერწყული", imageName: "aquarius", text: "მერწყული ერთ–ერთი ყველაზე რთული და წინააღმდეგობებით აღსავსე ნიშანია, რომლის წარმომადგენლებიც მუდამ ახალი შეგრძნებების ძიებაშია არიან. მათ ნიშანშია ჩადებული შინაგანი კონფლიქტი – ისინი ყოველთვის ისწრაფვიან თავისუფლებისკენ, ახალი გამოცდილების, ახალი ინფორმაციის მიღებისკენ", polar: "ლომი", polarIcon: "leo")

//var zodiacsArray: [Zodiacs] = [
//    Zodiacs(name: "ვერძი", imageName: "aries", text: "დაბადებულია მოგებისთვის, ძალიან აქტიური და კომუნიკაბელურია. არის თავმოყვარე, თავდაჯერებული, უშიშარი. მას მართავს გრძნობები, ჯერ აკეთებს და მერე ფიქრობს. იმპულსურია. გრძნობები უბინდავენ გონებას. ვნებიანი და ეგოისტია. ვერ იტანს, როცა რამეს უკრძალავენ. მათში ყველაფერი დიდი დოზითაა. ასევე ავანტიურისტია.", polar: "სასწორი", polarIcon: "libra"),
//    
//    Zodiacs(name: "კურო", imageName: "taurus", text: "პრაქტიკული, რეალისტი, პრაგმატული, პესიმისტი, უყვართ და პატივს სცემენ სიმდიდრეს, მაგრამ ხემოჭერილები არიან, უფრთხილდებიან იმას, რაც აქვთ. იზიდავთ გართობა და სიამოვნება. უყვართ სახლი და ოჯახი. მესაკუთრეები და კარგი მშობლები არიან. ჯიუტები, ძლიერი სულის პატრონები და შრომისმოყვარეები არიან. არ აქვთ არასრულყოფილების კომპლექსი. სულის სიღრმეში თავი სამყაროს ღერძებად მიაჩნიათ.", polar: "მორიელი", polarIcon: "scorpio"),
//    
//    Zodiacs(name: "ტყუპები", imageName: "gemini", text: "ძალიან უყვართ ჭორების და ინფორმაციების შეგროვება. იციან ყველაფერი ყველაფერზე და მათ შეიძლება შეხვდეთ ყველგან. გონებამახვილი, ცოცხალი, კომუნიკაბელური, მჭერმეტყველი.. ეს ყველაფერი ტყუპებზეა ნათქვამი. მათთან არ მოიწყენ. მიისწრაფიან სრულყოფილებისკენ, რათა ყველას თავი მოაწონონ. ადვილად ეგუებიან ყველაფერს. აქვთ უამრავი იდეა... სჭირთ გაორება.", polar: "მშვილდოსანი", polarIcon: "sagittarius"),
//    
//    Zodiacs(name: "კირჩხიბი", imageName: "cancer", text: "რომანტიკული, გულიანი, უყვართ ბავშვები, ცხოველებიც. აქვთ მაღალი პასუხისმგებლობის გრძნობა. არიან დაკომპლექსებულები, ძალიან ეჭვიანები, თავგანწირულები, სენტიმენტალურები და კონსერვატორები. მესაკუთრეები, მგრძნობიარეები. აქვთ მდიდარი ფანტაზია და კარგი ინტუიცია..", polar: "თხის რქა", polarIcon: "capricorn"),
//    
//    Zodiacs(name: "ლომი", imageName: "leo", text: "მამაცი, შეუპოვარი და გულუხვი. ცნობისმოყვარე, გავლენიანი, ცეცხლოვანი, უყვარს მართვა, საკუთარ თავზე შეყვარებული, ეგოცენტრიკი, პრესტიჟი მათთვის ყველაფერია, მიმზიდველი, არტისტული, მაგნიტური, დაბადებულია ლიდერად, რომანტიკული, ქარიზმატული, უყვართ ყურადღების ცენტრში ყოფნა და ხშირად იმსახურებენ კიდეც", polar: "მერწყული", polarIcon: "aquarius"),
//    
//    Zodiacs(name: "ქალწული", imageName: "virgo", text: "თავშეკავებული, პედანტური, ანალიტიკური გონება, კრიტიკოსი, ყურადღებას აქცევს წვრილმანებს, რაციონალური, გამოთვლილი და დაგეგმილი აქვს ყველაფერი. პრაქტიკოსი, მომთხოვნი, საღი გონების პატრონი.", polar: "თევზები", polarIcon: "pisces"),
//    
//    Zodiacs(name: "სასწორი", imageName: "libra", text: "გაუბედავი, ჰარმონიული, პაცეფისტი, დამთმობი, გაურბის კონფლიქტეპს, დიპლომატი, არ უყვარს მარტოობა, ხშირად სისულელეებს აკეთებს, იდეალისტი, რომანტიკოსი, მიმზიდველი, უყვარს ხელოვნება, ახასიათებს მოუთმენლობა.", polar: "ვერძი", polarIcon: "aries"),
//    
//    Zodiacs(name: "მორიელი", imageName: "scorpio", text: "მიდრეკილია დაპყრობისკენ, მისი დევიზია 'ყველაფერი ან არაფერი', ვნებიანია, მოსწონს მისტიკა, არღვევს ტაბუებს, თავდაჯერებული და მესაკუთრეა. ჯიუტი, რისკიანი, ემოციური, მიმწოლი ხასიათისაა.", polar: "კურო", polarIcon: "taurus"),
//    
//    Zodiacs(name: "მშვილდოსანი", imageName: "sagittarius", text: "პირდაპირი, სამართლიანი, აგრესიული ოპტიმისტი, უყვარს ძებნა და პოვნა, არ აქვს ზომიერების შეგრძნება, სულ მოძრაობს, ფარული სურვილი აქვს ფლობის, იმპულსურია.", polar: "ტყუპები", polarIcon: "gemini"),
//    
//    Zodiacs(name: "თხის რქა", imageName: "capricorn", text: "ახასიათებს თავმოყვარეობა, სიმდიდრის სიყვარული, პრაგმატულობა, სიფრთხილე, ამბიციურობა, თავშეკავებულობა, დამოუკიდებლობა . მათთვის ძალიან მნიშვნელოვანია მატერიალური კეთილდღეობა და სტატუსი. არიან კარიერისტები და კონსერვატორები. მერწყული: ორიგინალური, ალტრუისტი, იდეალისტი, იდეალური მებრძოლი, კომუნიკაბელური, თავისუფლების მოყვარული, ექსტრავაგანტული, უყვარს პუბლიკის შოკურ მდგომარეობამდე მიყვანა. არიან ინტელექტუალები, ვერ იტანენ რუტინულ ცხოვრებას.", polar: "კირჩხიბი", polarIcon: "cancer"),
//    
//    Zodiacs(name: "თევზები", imageName: "pisces", text: "მგრძნობიარე მეოცნებეები, მდიდარი ფანტაზია, მიმზიდველობა, შემოქმედებითი ხასიათი, არტისტიზმი, პასიურები, გაუბედავები, ფატალურები, რეფლექსურები, აქვთ კარგი ინტუიცია.", polar: "ქალწული", polarIcon: "virgo"),
//    
//    Zodiacs(name: "მერწყული", imageName: "aquarius", text: "მერწყული ერთ–ერთი ყველაზე რთული და წინააღმდეგობებით აღსავსე ნიშანია, რომლის წარმომადგენლებიც მუდამ ახალი შეგრძნებების ძიებაშია არიან. მათ ნიშანშია ჩადებული შინაგანი კონფლიქტი – ისინი ყოველთვის ისწრაფვიან თავისუფლებისკენ, ახალი გამოცდილების, ახალი ინფორმაციის მიღებისკენ", polar: "ლომი", polarIcon: "leo")
//]


